HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/propeller/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar
runApplication noise
# -----------------------------------------------------------------------------
