HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;
    libs            ( "libfvMeshMovers.so" "libfvMotionSolvers.so" );
    motionSolver    motionSolverList;
    solvers
    {
        innerCylinderSmall
        {
            solver          solidBody;
            cellZone        innerCylinderSmall;
            referenceFrame  rotatingFrame;
        }
    }
}


// ************************************************************************* //
