HELYXcore-4.4.0/examples/legacy/incompressible/pimpleDyMFoam/propeller/system/noiseDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R) Core: Open-source CFD for Enterprise            |
|   o   O   o      | Version: 4.4.0                                           |
|    o     o       | ENGYS Ltd. <http://engys.com/>                           |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      noiseDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

noiseModel     pointNoise; // surfaceNoise;

surfaceNoiseCoeffs
{
    windowModel     Hanning;

    HanningCoeffs
    {
        // Window overlap percentage
        overlapPercent  50;
        symmetric       yes;
        extended        yes;

        // Optional number of windows, default = all available
        // nWindow         1;
    }

/*
    windowModel     uniform;

    uniformCoeffs
    {
        // Window overlap percentage
        overlapPercent  50;

        value           1;

        // Optional number of windows, default = all available
        // nWindow         1;
    }
*/


    // Input file
    inputFile   "postProcessing/faceSource1/surface/patch_motorBike_rider-helmet%65/patch_motorBike_rider-helmet%65.case";

    // Surface reader
    reader      ensight;

    // Surface writer
    writer      ensight;

    // Collate times for ensight output - ensures geometry is only written once
    writeOptions
    {
        ensight
        {
            collateTimes true;
        }
    }

    // Reference density (to convert from kinematic to static pressure)
    rhoRef          1.205;

    // Number of samples in sampling window
    // Must be a power of 2, default = 2^16 (=65536)
    N               4096; // 8192; // 4096;

    // Lower frequency limit, default = 25Hz
    //fl              25;

    // Upper frequency limit, default = 10kHz
    fu              15000;

    // Start time, default = 0s
    //startTime       0;

    // Write interval for FFT data, default = 1
//    fftWriteInterval 100;
}

pointNoiseCoeffs
{
	
	files
	(
	  "postProcessing/FW-H-all/0/FfowcsWilliamsHawkings.dat" 
	  "postProcessing/KFWH-all/0/FfowcsWilliamsHawkings.dat" 
	);
	
	nHeaderLine     2;
	refColumn       0;
    componentColumns (2);
    separator       " ";
    mergeSeparators yes;
    
        
    windowModel     Hanning;
    HanningCoeffs
    {
        // Window overlap percentage
        overlapPercent  50;
        symmetric       yes;
        extended        yes;

        // Optional number of windows, default = all available
        //nWindow         5;
    }

    // Graph format, default = raw
    graphFormat     raw;

    // Reference density (to convert from kinematic to static pressure)
    rhoRef          1;

    // Number of samples in sampling window
    // Must be a power of 2, default = 2^16 (=65536)
    N              512;

    // Lower frequency limit, default = 25Hz
    fl              10;

    // Upper frequency limit, default = 10kHz
    fu              5000;

    // Start time, default = 0s
    startTime       0.02;

    // Write interval for FFT data, default = 1
    fftWriteInterval 1;
}


// ************************************************************************* //
